In [ ]:
#import libraries

import mysql.connector
from mysql.connector import Error
import pandas as pd

In [2]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            password = user_password 
         ) 
        print(" MySQL Database connection successful")
    except Error as err:
            print(f"Error: '{err}'")
    return connection
                  
# Pu our MySql Terminal password
pw = "LakRai@28"

#Database name
db = "mysql_python" 
connection = create_server_connection ( "localhost" , "root", pw)

 MySQL Database connection successful

In [3]:
# Create mysql_python

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database create successfully")
    except Error as err:
            print(f"Error: '{err}'")
create_database_query = "Create database mysql_python" 
create_database(connection,create_database_query)

Error: '1007 (HY000): Can't create database 'mysql_python'; database exists'

In [4]:
# Connect to database

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
             host = host_name,
             user = user_name,
             passwd = user_password,
             database = db_name)
        print("MySQL database connection successfull")
    except Error as err:
            print(f"Error: '{err}'")
    return connection

In [5]:
# Execute sql queries

def execute_query(connection, query):
    cursor = connection.cursor()
    try :
        cursor.execute(query)
        connection.commit()
        print("Query was successfull")
    except Error as err:
            print(f"Error: '{err}'")

In [6]:
create_orders_table = """
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(20));
"""
#connect to the database

connection = create_db_connection("localhost" , "root" , pw, db)
execute_query(connection, create_orders_table)

MySQL database connection successfull
Error: '1050 (42S01): Table 'orders' already exists'

In [8]:
# Inser data

data_orders = """
insert into orders values
(101, 'Steve' , 'Laptop' , '2018-06-12', 2, 800, '6293730802'),
(102, 'Jos' , 'Books' , '2019-02-10', 10, 12, '7809123456'),
(103, 'Stacy' , 'Trousers' , '2019-12-25', 5, 50, '9085612387'), 
(104, 'Nancy' , 'T-shirts' , '2018-07-14', 7, 30, '6709134256'), 
(105, 'Maria' , 'Headphones' , '2019-05-30', 6, 48, '8907632451'),
(106, 'Danny' , 'Smart TV' , '2018-08-20', 10, 300, '5678091234');
"""
connection = create_db_connection("localhost" , "root" , pw, db)
execute_query(connection, data_orders)

MySQL database connection successfull
Query was successfull

In [10]:
def read_query(connection,query):
    cursor = connection.cursor()
    result = None
    try: 
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
            print(f"Error: '{err}'")

In [11]:
# Using the select statement

q1 = """ 
select * from orders;
"""
connection = create_db_connection("localhost" , "root" , pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '7809123456')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '9085612387')
(104, 'Nancy', 'T-shirts', datetime.date(2018, 7, 14), 7, 30.0, '6709134256')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8907632451')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '5678091234')

In [12]:
q2 = """ 
select customer_name,phone_number from orders;
"""
connection = create_db_connection("localhost" , "root" , pw, db)
results = read_query(connection, q2)
for result in results:
    print(result)

MySQL database connection successfull
('Steve', '6293730802')
('Jos', '7809123456')
('Stacy', '9085612387')
('Nancy', '6709134256')
('Maria', '8907632451')
('Danny', '5678091234')

In [14]:
q3 = """ 
select year(date_ordered) from orders;
"""
connection = create_db_connection("localhost" , "root" , pw, db)
results = read_query(connection, q3)
for result in results:
    print(result)

MySQL database connection successfull
(2018,)
(2019,)
(2019,)
(2018,)
(2019,)
(2018,)

In [15]:
q4 = """ 
select distinct year(date_ordered) from orders;
"""
connection = create_db_connection("localhost" , "root" , pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

MySQL database connection successfull
(2018,)
(2019,)

In [17]:
q5 = """ 
select * from orders where date_ordered< '2018-12-31';
"""
connection = create_db_connection("localhost" , "root" , pw, db)
results = read_query(connection, q5)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(104, 'Nancy', 'T-shirts', datetime.date(2018, 7, 14), 7, 30.0, '6709134256')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '5678091234')

In [18]:
q6 = """ 
select * from orders where date_ordered > '2018-12-31';
"""
connection = create_db_connection("localhost" , "root" , pw, db)
results = read_query(connection, q6)
for result in results:
    print(result)

MySQL database connection successfull
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '7809123456')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '9085612387')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8907632451')

In [21]:
q7 = """ 
select * from orders order by unit_price desc;
"""
connection = create_db_connection("localhost" , "root" , pw, db)
results = read_query(connection, q7)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '5678091234')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '9085612387')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8907632451')
(104, 'Nancy', 'T-shirts', datetime.date(2018, 7, 14), 7, 30.0, '6709134256')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '7809123456')

In [23]:
from_db = [] 
for result in results:
    result = list(result)
    from_db.append(result)
columns = ["order_id", "customer_name", "product_name", "date_ordered", "quantity" ,
           "unit_price", "phone_number"] 
df = pd.DataFrame(from_db, columns = columns)

display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Steve,Laptop,2018-06-12,2,800.0,6293730802
1,106,Danny,Smart TV,2018-08-20,10,300.0,5678091234
2,103,Stacy,Trousers,2019-12-25,5,50.0,9085612387
3,105,Maria,Headphones,2019-05-30,6,48.0,8907632451
4,104,Nancy,T-shirts,2018-07-14,7,30.0,6709134256
5,102,Jos,Books,2019-02-10,10,12.0,7809123456

In [24]:
#Update command

update = """
update orders
set unit_price = 45
where order_id = 103
"""
connection = create_db_connection("localhost" , "root" , pw, db)
execute_query(connection, update)

MySQL database connection successfull
Query was successfull

In [25]:
q8 = """ 
select * from orders where order_id = 103;
"""
connection = create_db_connection("localhost" , "root" , pw, db)
results = read_query(connection, q8)
for result in results:
    print(result)

MySQL database connection successfull
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '9085612387')

In [26]:
# Delete command

delete_order = """
delete from orders
where order_id = 105;

"""
connection = create_db_connection("localhost" , "root" , pw, db)
execute_query(connection, delete_order)

MySQL database connection successfull
Query was successfull

In [27]:
q9 = """ 
select * from orders;
"""
connection = create_db_connection("localhost" , "root" , pw, db)
results = read_query(connection, q9)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '7809123456')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '9085612387')
(104, 'Nancy', 'T-shirts', datetime.date(2018, 7, 14), 7, 30.0, '6709134256')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '5678091234')